tap "smudge/smudge"
tap "xykong/tap"
brew "fzf"
brew "gh"
brew "git"
brew "sdl2"
brew "sox"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "zoxide"
brew "smudge/smudge/nightlight"
cask "1password"
cask "affinity"
cask "alcove"
cask "anki"
cask "audio-hijack"
cask "bunch"
cask "chatgpt"
cask "claude"
cask "codex"
cask "discord"
cask "dockdoor"
cask "fantastical"
cask "figma"
cask "firefox@developer-edition"
cask "xykong/tap/flux-markdown"
cask "github"
cask "granola"
cask "iina"
cask "keka"
cask "linear-linear"
cask "linearmouse"
cask "macwhisper"
cask "mixed-in-key"
cask "notion"
cask "notion-calendar"
cask "openrct2"
cask "pcsx2"
cask "plex-media-server"
cask "proton-mail"
cask "protonvpn"
cask "raindropio"
cask "raycast"
cask "replacicon"
cask "setapp"
cask "slack"
cask "soundsource"
cask "spatial"
cask "spotify"
cask "steam"
cask "steelseries-gg"
cask "swinsian"
cask "thebrowsercompany-dia"
cask "transmit"
cask "visual-studio-code"
cask "wallspace"
cask "warp"
cask "whatsapp"
cask "wispr-flow"
cask "xld"
cask "zoom"
vscode "acestojanoski.ace-palenight"
vscode "ankitcode.firefly"
vscode "anthropic.claude-code"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "cipchk.cssrem"
vscode "dustypomerleau.tol"
vscode "dustypomerleau.yarra-valley"
vscode "esbenp.prettier-vscode"
vscode "geddski.macros"
vscode "github.copilot-chat"
vscode "harg.iceberg"
vscode "hermitter.oh-lucy-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "jacobcassidy.css-nesting-syntax-highlighting"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "monokai.theme-monokai-pro-vscode"
vscode "motion.motion-vscode-extension"
vscode "ms-vscode.sublime-keybindings"
vscode "naumovs.color-highlight"
vscode "sanity-io.vscode-sanity"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "wakatime.vscode-wakatime"
